БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеОбЭмиссииКММДЛП/УведомлениеОбЭмиссииКММДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОбЭмиссииКММДЛП</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеУведомленияОбЭмиссииКММДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ОрганизацииМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПодтверждения</name>
    <type>
      <types>EnumRef.СостоянияПодтвержденияМДЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗаказаСУЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПередачаСведенийЧерезСКЗКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераУпаковок</name>
    <attributes>
      <name>НомерКИЗ</name>
      <type>
        <types>DefinedType.НомерУпаковкиМДЛП</types>
      </type>
    </attributes>
    <attributes>
      <name>Отклонено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СтатусыИнформированияМДЛП/СтатусыИнформированияМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыИнформированияМДЛП</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформированияМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие1</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие2</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие3</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюМДЛП</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие4</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюМДЛП</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументИнформированияМДЛП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ОперацииОбменаМДЛП/ОперацииОбменаМДЛП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииОбменаМДЛП</name>
  <enumValues>
    <name>Получение_КвитанцияОФиксации</name>
    <comment>200</comment>
  </enumValues>
  <enumValues>
    <name>Получение_РезультатФиксацииИзменений</name>
    <comment>201</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ЗапросСоставаУпаковки</name>
    <comment>210</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ЗапросИнформацииОКиЗ</name>
    <comment>210</comment>
  </enumValues>
  <enumValues>
    <name>Получение_СоставУпаковки</name>
    <comment>211</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ИнформацияОКиЗ</name>
    <comment>211</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ИзменениеСпискаДоверенныхКонтрагентов</name>
    <comment>212</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ЗапросИерархииВложенностиУпаковок</name>
    <comment>220</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ИерархияВложенностиУпаковок</name>
    <comment>221</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтказОтРанееСовершеннойОперации</name>
    <comment>250</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтзывПереданногоТовара</name>
    <comment>251</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтказОтПриемкиТовара</name>
    <comment>252</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПередачаКМТаможенномуСкладу</name>
    <comment>300</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ЗавершениеЭтапаОкончательнойУпаковки</name>
    <comment>311</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтборОбразцовДляПодтвержденияКачества</name>
    <comment>312</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВыпускГотовойПродукции</name>
    <comment>313</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтгрузкаЛПДляВыпускаГотовойПродукции</name>
    <comment>314</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВозвратКонтрактномуПроизводителю</name>
    <comment>315</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВыпускГотовойПродукцииЗаПределамиРФ</name>
    <comment>321</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтгрузкаЛПвРФ</name>
    <comment>331</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ЗагрузкаСведенийОВвозеЛПвРФ</name>
    <comment>332</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВвозЛекарственныхПрепаратовВРФ</name>
    <comment>332</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВвозЛекарственныхПрепаратовВРФБезИмпортера</name>
    <comment>333</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПеремещениеЛПМеждуЗТК</name>
    <comment>334</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ТаможенноеОформление</name>
    <comment>335</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_УсловияВвозаЛПвРФМаркированныхВЗТК</name>
    <comment>336</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПриемкаЛПНаСкладИмпортера</name>
    <comment>341</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВводЛекарственныхПрепаратовВОборотРФ</name>
    <comment>342</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_СменаСобственникаНаТаможне</name>
    <comment>351</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВвозСобственныхЛекарственныхПрепаратовВРФизЕСЭС</name>
    <comment>360</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВвозЛекарственныхПрепаратовВРФизЕСЭС</name>
    <comment>362</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВводЛекарственныхПрепаратовВОборот</name>
    <comment>363</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПередачаЛПСобственнику</name>
    <comment>381</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПовторныйВводВОборот</name>
    <comment>391</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтгрузкаЛПСоСклада</name>
    <comment>415</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПриемкаЛПНаСклад</name>
    <comment>416</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВозвратПриостановленныхЛП</name>
    <comment>417</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПеремещениеЛП</name>
    <comment>431</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ПеремещениеЛП</name>
    <comment>431</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтгрузкаЛПСоСкладаНезарегистрированномуУчастнику</name>
    <comment>441</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПриемкаЛПНаСкладРанееНеЗарегистрированный</name>
    <comment>442</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтгрузкаЛПСоСкладаЕАЭС</name>
    <comment>461</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПеремещениеЛП_ГЛО</name>
    <comment>470</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ПеремещениеЛП_ГЛО</name>
    <comment>470</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтгрузкаЛПСоСкладаВРамкахГЛО</name>
    <comment>471</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтгрузкаЛПСоСкладаВРамкахАгентскогоДоговора</name>
    <comment>472</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПриемкаЛПАгентомВРамкахАгентскогоДоговора</name>
    <comment>473</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПостановкаСнятиеАрбитража</name>
    <comment>481</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_РозничнаяПродажаЛП</name>
    <comment>511</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтпускЛППоДокументамОтличнымОтЧека</name>
    <comment>512</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтпускЛППоЛьготнымРецептам</name>
    <comment>521</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощи</name>
    <comment>531</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПередачаЛПНаУничтожение</name>
    <comment>541</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_УничтожениеЛП</name>
    <comment>542</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_Реэкспорт</name>
    <comment>551</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВыводИзОборотаЛППоРазличнымПричинам</name>
    <comment>552</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ВыводИзОборотаЛППоРазличнымПричинам</name>
    <comment>552</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтгрузкаЛПСоСкладаПродавца</name>
    <comment>601</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ПриемкаЛПНаСкладПокупателя</name>
    <comment>602</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ПередачаЛПСобственнику</name>
    <comment>603</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтзывОтправителемПереданногоТовара</name>
    <comment>605</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтказПолучателяОтПриемкиТовара</name>
    <comment>606</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ПодтверждениеСведенийОПриемке</name>
    <comment>607</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ВыводЛПИзОборотаПоКассе</name>
    <comment>608</comment>
  </enumValues>
  <enumValues>
    <name>Получение_СменаСобственникаНаТаможне</name>
    <comment>609</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ВозвратПриостановленныхЛП</name>
    <comment>610</comment>
  </enumValues>
  <enumValues>
    <name>Получение_РегистрацияПолучателяИПриемкаНаСклад</name>
    <comment>611</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтгрузкаЛПСоСкладВРамкахГЛО</name>
    <comment>612</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтгрузкаЛПвРФ</name>
    <comment>613</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ВвозЛекарственныхПрепаратовВРФ</name>
    <comment>614</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтгрузкаЛПвРФизЕАЭС</name>
    <comment>615</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОшибкиПриПриемкеЛПНаСкладеПолучателя</name>
    <comment>617</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтгрузкаЛПДляВыпускаГотовойПродукции</name>
    <comment>618</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтгрузкаЛПвРамкахАгентскогоДоговора</name>
    <comment>619</comment>
  </enumValues>
  <enumValues>
    <name>Получение_УсловияВвозаЛПвРФМаркированныхВЗТК</name>
    <comment>620</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ПостановкаСнятиеАрбитража</name>
    <comment>621</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ВозвратКонтрактномуПроизводителю</name>
    <comment>622</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ПриемкаЛПвРамкахАгентскогоДоговора</name>
    <comment>624</comment>
  </enumValues>
  <enumValues>
    <name>Получение_УведомлениеВладельцаОбОприходовании</name>
    <comment>627</comment>
  </enumValues>
  <enumValues>
    <name>Получение_УведомлениеВладельцаОбОприходованииИмпорт</name>
    <comment>628</comment>
  </enumValues>
  <enumValues>
    <name>Получение_АвтоматическоеСписаниеЛПсИстекшимСрокомГодности</name>
    <comment>632</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПодтверждениеСведенийОПриемке</name>
    <comment>701</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_Оприходование</name>
    <comment>702</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОприходованиеИмпорт</name>
    <comment>703</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ПерепаковкаИПеремаркировка</name>
    <comment>811</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_Агрегирование</name>
    <comment>911</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_РасформированиеТранспортнойУпаковки</name>
    <comment>912</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ИзъятиеЭлементовУпаковки</name>
    <comment>913</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВключениеЭлементовВТранспортнуюУпаковку</name>
    <comment>914</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_АгрегированиеВоМножествоУпаковок</name>
    <comment>915</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВключениеЭлементовВоМножествоТранспортныхУпаковок</name>
    <comment>916</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ЭмиссияКМ</name>
    <comment>10300</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ЗавершениеОкончательнойУпаковкиСКЗКМ</name>
    <comment>10311</comment>
  </enumValues>
  <enumValues>
    <name>Получение_УпаковкаЗаПределамиРФСКЗКМ</name>
    <comment>10319</comment>
  </enumValues>
  <enumValues>
    <name>Получение_РозничнаяПродажаККТ</name>
    <comment>10511</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтпускЛППоЛьготнымРецептамСКЗКМ</name>
    <comment>10521</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтпускЛППоЛьготнымРецептамККТ</name>
    <comment>10522</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ОтпускЛПСНевалиднымКМПоЛьготнымРецептамСКЗКМ</name>
    <comment>10523</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ</name>
    <comment>10531</comment>
  </enumValues>
  <enumValues>
    <name>Получение_ВыдачаЛПСНевалиднымКМДляОказанияМедицинскойПомощиСКЗКМ</name>
    <comment>10532</comment>
  </enumValues>
  <enumValues>
    <name>Получение_КвитанцияОПринятии</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтпускЛППоЛьготнымРецептамСКЗКМ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанных_ОтсутствиеЛПНаБалансеМДЛП</name>
    <comment>705</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/УведомлениеОбЭмиссииКММДЛП/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ИнтеграцияМДЛПВызовСервера.ПриПолученииФормыДокумента(
		ПустаяСсылка(), ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДействияПриОбмене

Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция) Экспорт
	
	Возврат ИнтеграцияМДЛП.ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция);
	
КонецФункции

Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки) Экспорт
	
	Возврат ИнтеграцияМДЛП.ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки);
	
КонецФункции

Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, Операция, ДанныеКвитанции) Экспорт
	
	ОперацияКвитанции = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКвитанции, "ОперацияКвитанции");
	Если ОперацияКвитанции = Перечисления.ОперацииОбменаМДЛП.Получение_ЭмиссияКМ Тогда
		ДанныеКвитанции.Вставить("ЗавершитьПриОтказе", Истина);
	КонецЕсли;
	
	Возврат ИнтеграцияМДЛП.ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, Операция, ДанныеКвитанции);
	
КонецФункции

Процедура ОбновитьСостояниеПодтверждения(ДокументОбъект, Операция, Сообщение, СтатусОбработки, ОтклоненныеНомера = Неопределено) Экспорт
	
	ПараметрыОбновления = ИнтеграцияМДЛП.СостояниеПодтверждения(Операция, Сообщение, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.СостояниеПодтверждения = ПараметрыОбновления.Состояние;
	Если ДокументОбъект.СостояниеПодтверждения <> Перечисления.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ
	   И ЗначениеЗаполнено(ОтклоненныеНомера) Тогда
		
		Номера = ДокументОбъект.НомераУпаковок.Выгрузить(, "НомерКИЗ, НомерСтроки");
		Номера.Индексы.Добавить("НомерКИЗ");
		Для Каждого Номер Из ОтклоненныеНомера Цикл
			Строка = ДокументОбъект.НомераУпаковок[Номера.Найти(Номер.Ключ, "НомерКИЗ").НомерСтроки - 1];
			Строка.Отклонено = Истина;
			Строка.ПричинаОтказа = ИнтеграцияМДЛП.ПредставлениеПричиныОтклонения(Номер.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Определить необходимость перерасчета статуса оформления документов.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УведомлениеОРозничнойПродажеМДЛП - Документ, по которому требуется рассчитать статус оформления.
//  ПредыдущийСтатус - ПеречислениеСсылка.СтатусыОбработки - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.СтатусыОбработки - Новый статус.
// 
// Возвращаемое значение:
//  Булево - Необходимость перерасчета статуса оформления.
//
Функция РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус) Экспорт
	
	Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Основание");
	Если ЗначениеЗаполнено(Основание) Тогда
		ИнтеграцияМДЛППереопределяемый.РассчитатьСтатусОформленияУведомленияОбЭмиссииКМ(Основание);
	КонецЕсли;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияМДЛП.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	Таблица = ИнтеграцияМДЛП.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ТипыСообщенийМДЛП.Исходящее;
	
	ПередачаСведенийЧерезСКЗКМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ПередачаСведенийЧерезСКЗКМ");
	Если ПередачаСведенийЧерезСКЗКМ = Истина Тогда
		ИнтеграцияМДЛП.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ОперацииОбменаМДЛП.Получение_ЭмиссияКМ);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область Статусы

// Возвращает статус информирования по умолчанию.
// 
// Возвращаемое значение:
//  Перечисления.СтатусыИнформированияМДЛП - Статус по-умолчанию.
//
Функция СтатусИнформированияПоУмолчанию() Экспорт
	
	Возврат Перечисления.СтатусыИнформированияМДЛП.Черновик;
	
КонецФункции

// Возвращает дальнейшее действие по умолчанию.
// 
// Возвращаемое значение:
//  Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП - Дальнейшее действие по-умолчанию.
//
Функция ДальнейшееДействиеПоУмолчанию() Экспорт
	
	Возврат Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.НеТребуется;
	
КонецФункции

// Возвращает запрос для получения статуса оформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Документ основание.
// 
// Возвращаемое значение:
//  Запрос - Запрос для получения статуса оформления.
//
Функция ЗапросСтатусаОформления(ДокументОснование) Экспорт
	
	Запрос = ИнтеграцияМДЛППереопределяемый.ЗапросСтатусаОформленияУведомленияОбЭмиссииКМ(ДокументОснование);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область ПанельМаркировкиМДЛП

Функция ВсеТребующиеДействия(Все = Ложь) Экспорт
	
	Действия = Новый Массив;
	Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ПередайтеДанные);
	Если Все Или Не ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхМДЛП") Тогда
		Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ВыполнитеОбмен);
	КонецЕсли;
	Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ПолучитеКвитанциюОФиксации);
	
	Возврат Действия;
	
КонецФункции

Функция ВсеТребующиеОжидания(Все = Ложь) Экспорт
	
	Действия = Новый Массив;
	Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ОжидайтеПолучениеКвитанцииОФиксации);
	Если Все Или ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхМДЛП") Тогда
		Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ОжидайтеПередачуДанныхРегламентнымЗаданием);
	КонецЕсли;
	
	Возврат Действия;
	
КонецФункции

Процедура ПриЗаполненииДокументовПанелиМаркировкиМДЛП(ТаблицаДокументы) Экспорт
	
	Описание = ИнтеграцияМДЛП.ДобавитьДокументНаПанельМаркировки(
		ТаблицаДокументы,
		Метаданные.Документы.УведомлениеОбЭмиссииКММДЛП,
		НСтр("ru = 'Эмиссия КМ (информация от СУЗ)'"),
		ИнтеграцияМДЛПКлиентСервер.ПанельМаркировкаРазделИмпортЭкспорт());
	
	Описание.Оформите    = Истина;
	Описание.Отработайте = Истина;
	Описание.Ожидайте    = Истина;
	
	Описание.Порядок = 10;
	
КонецПроцедуры

// Возвращает текст запроса для получения количества документов для оформления
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаОформите() Экспорт
	
	Возврат ИнтеграцияМДЛППереопределяемый.УведомлениеОбЭмиссииКМТекстЗапросаОформите();
	
КонецФункции

// Возвращает текст запроса для получения количества документов для отработки
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаОтработайте() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Статусы.Документ) КАК КоличествоДокументов
	|ИЗ
	|	РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОбЭмиссииКММДЛП КАК Уведомления
	|	ПО
	|		Статусы.Документ = Уведомления.Ссылка
	|ГДЕ
	|	НЕ Уведомления.ПометкаУдаления
	|	И Статусы.ДальнейшееДействие1 В(&ВсеТребующиеДействия)
	|	И (&Организация = НЕОПРЕДЕЛЕНО ИЛИ Уведомления.Организация = &Организация)
	|	И (&Ответственный = НЕОПРЕДЕЛЕНО ИЛИ Уведомления.Ответственный = &Ответственный)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса для получения количества документов, находящихся в состоянии ожидания
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаОжидайте() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Статусы.Документ) КАК КоличествоДокументов
	|ИЗ
	|	РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОбЭмиссииКММДЛП КАК Уведомления
	|	ПО
	|		Статусы.Документ = Уведомления.Ссылка
	|ГДЕ
	|	НЕ Уведомления.ПометкаУдаления
	|	И Статусы.ДальнейшееДействие1 В(&ВсеТребующиеОжидания)
	|	И (&Организация = НЕОПРЕДЕЛЕНО ИЛИ Уведомления.Организация = &Организация)
	|	И (&Ответственный = НЕОПРЕДЕЛЕНО ИЛИ Уведомления.Ответственный = &Ответственный)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса для формирования данных динамического списка формы списка и формы выбора документов.
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаДинамическогоСписока() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Уведомления.Ссылка                                                              КАК Ссылка,
	|	Уведомления.ПометкаУдаления                                                     КАК ПометкаУдаления,
	|	Уведомления.Номер                                                               КАК Номер,
	|	Уведомления.Дата                                                                КАК Дата,
	|	Уведомления.Проведен                                                            КАК Проведен,
	|	Уведомления.Основание                                                           КАК Основание,
	|	Уведомления.Организация                                                         КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.МестаДеятельностиМДЛП.ПустаяСсылка)                         КАК МестоДеятельности,
	|	Уведомления.Ответственный                                                       КАК Ответственный,
	|	Уведомления.Комментарий                                                         КАК Комментарий,
	|	ЕСТЬNULL(Статусы.ДальнейшееДействие1,
	|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюМДЛП.НеТребуется))  КАК ДальнейшееДействие1,
	|	ЕСТЬNULL(Статусы.ДальнейшееДействие2,
	|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюМДЛП.НеТребуется))  КАК ДальнейшееДействие2,
	|	ЕСТЬNULL(Статусы.ДальнейшееДействие3,
	|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюМДЛП.НеТребуется))  КАК ДальнейшееДействие3,
	|	ЕСТЬNULL(Статусы.ДальнейшееДействие4,
	|		ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюМДЛП.НеТребуется))  КАК ДальнейшееДействие4,
	|	ЕСТЬNULL(Статусы.Статус,
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыИнформированияМДЛП.Отсутствует))               КАК Статус
	|ИЗ
	|	Документ.УведомлениеОбЭмиссииКММДЛП КАК Уведомления
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СтатусыИнформированияМДЛП КАК Статусы
	|	ПО
	|		Статусы.Документ = Уведомления.Ссылка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса для формирования данных динамического Списка к оформлению формы списка и формы выбора документов.
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаДинамическогоСпискаКОформлению() Экспорт
	
	ТекстЗапроса = ИнтеграцияМДЛППереопределяемый.УведомлениеОбЭмиссииКМТекстЗапросаДинамическогоСпискаКОформлению();
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ТекстЗапроса = Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаДинамическогоСпискаКОформлениюФормДокументов();
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СообщениеМДЛП

Функция СообщениеКПередаче(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Возврат УведомлениеОбЭмиссииКММДЛП(ДокументСсылка);
	
КонецФункции

Функция ОпределитьДокументыДляЗагрузки(ДанныеДокумента, Операция) Экспорт
	
	Если Операция = Перечисления.ОперацииОбменаМДЛП.Получение_ЭмиссияКМ Тогда
		Возврат ОпределитьУведомлениеОбЭмиссииКМ(ДанныеДокумента);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьВходящееСообщение(ДанныеДокумента, Операция, ДокументСсылка) Экспорт
	
	Если Операция = Перечисления.ОперацииОбменаМДЛП.Получение_ЭмиссияКМ Тогда
		ЗагрузитьУведомлениеОбЭмиссииКМ(ДанныеДокумента, ДокументСсылка);
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неизвестная операция %1'"), Операция);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает данные для заполнения представления документа.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//  * КомандаСоздать - Строка - Представление документа, если документ требуется создать.
//  * ИмяКомандыСоздать - Строка - Имя команды "Создать".
//  * ИмяКомандыОткрыть - Строка - Имя команды "Открыть".
//  * ДокументОтсутствуетНетПравНаСоздание - Строка - Представление документа, если документ не создан.
//  * Представление - Строка - Представление документа.
//  * НесколькоДокументовПредставление - Строка - Представление документа, если их несколько.
//
Функция ПредставлениеДокумента() Экспорт
	
	ВозвращаемоеЗначение = ИнтеграцияМДЛП.ПустоеПредставлениеДокумента();
	ВозвращаемоеЗначение.КомандаСоздать                       = НСтр("ru = 'Создать уведомление об эмиссии кодов маркировки МДЛП'");
	ВозвращаемоеЗначение.ИмяКомандыСоздать                    = "СоздатьУведомлениеОбЭмиссииКММДЛП";
	ВозвращаемоеЗначение.ИмяКомандыОткрыть                    = "ОткрытьУведомлениеОбЭмиссииКММДЛП";
	ВозвращаемоеЗначение.ДокументОтсутствуетНетПравНаСоздание = НСтр("ru = 'Уведомление об эмиссии кодов маркировки МДЛП не создано'");
	ВозвращаемоеЗначение.Представление                        = НСтр("ru = 'Уведомление об эмиссии кодов маркировки МДЛП: %1'");
	ВозвращаемоеЗначение.НесколькоДокументовПредставление     = НСтр("ru = 'Уведомление об эмиссии кодов маркировки МДЛП (%1)'");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПоддерживаетЗагрузкуУведомлений() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УведомлениеОбЭмиссииКММДЛП(ДокументСсылка)
	
	Сообщения = Новый Массив;
	
	Возврат Сообщения;
	
КонецФункции

Функция ОпределитьУведомлениеОбЭмиссииКМ(ДанныеДокумента)
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПолучитьСсылку());
	
КонецФункции

Процедура ЗагрузитьУведомлениеОбЭмиссииКМ(ДанныеДокумента, ДокументСсылка)
	
	Если ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОрганизации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "subject_id");
	GTIN = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "gtin");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "oms_id") Тогда
		ИдентификаторСУЗ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "oms_id");
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "oms_order_id") Тогда
		ИдентификаторЗаказаСУЗ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "oms_order_id");
	КонецЕсли;
	
	Документ = СоздатьДокумент();
	Документ.УстановитьСсылкуНового(ДокументСсылка);
	Документ.Дата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "operation_date", ТекущаяДатаСеанса());
	ИнтеграцияМДЛП.ПолучитьОрганизациюМестоДеятельностиПоИдентификатору(ИдентификаторОрганизации, Документ.Организация);
	
	Документ.GTIN = GTIN;
	Документ.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Передано;
	Документ.ПередачаСведенийЧерезСКЗКМ = Истина;
	
	Документ.ИдентификаторСУЗ = ИдентификаторСУЗ;
	Документ.ИдентификаторЗаказаСУЗ = ИдентификаторЗаказаСУЗ;
	
	Для Каждого НомерУпакоки Из ДанныеДокумента.signs.sgtin Цикл
		
		СтрокаУпаковки = Документ.НомераУпаковок.Добавить();
		СтрокаУпаковки.НомерКИЗ = НомерУпакоки;
		
	КонецЦикла;
	
	ИнтеграцияМДЛППереопределяемый.ПриЗагрузкеУведомленияОбЭмиссииКМ(Документ);
	
	РезультатОбработки = ДанныеДокумента.Квитанция.result.operation_result;
	Если РезультатОбработки = "Accepted" Или РезультатОбработки = "Partial" Тогда
		Документ.Проведен = Истина;
		// Упаковки будут зарезервированы при проведении
		Документ.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	Иначе
		// Резервировать не требуется, так как отказано в регистрации сведений.
		Документ.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Передано;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ЗаписатьДокумент(Документ);
	
КонецПроцедуры

#Область Серии

// Имена реквизитов, от значений которых зависят параметры указания серий
//
// Возвращаемое значение:
//  Строка - имена реквизитов, перечисленные через запятую
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	
	Возврат ГосударственныеИнформационныеСистемыПереопределяемый.ИменаРеквизитовДляЗаполненияПараметровУказанияСерий(ПустаяСсылка().Метаданные());
	
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе.
//
// Параметры:
//  Объект - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
// 
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	Возврат ГосударственныеИнформационныеСистемыПереопределяемый.ПараметрыУказанияСерий(ПустаяСсылка().Метаданные(), Объект);
	
КонецФункции

// Возвращает текст запроса для расчета статусов указания серий
//
// Параметры:
//  ПараметрыУказанияСерий - Структура
//
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	Возврат ГосударственныеИнформационныеСистемыПереопределяемый.ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПустаяСсылка().Метаданные(), ПараметрыУказанияСерий);
	
КонецФункции

#КонецОбласти

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции Подключаемые.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт
	
	ГосударственныеИнформационныеСистемыПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
